## 1. Import Libraries

In [2]:
import pandas as pd

import numpy as np

import os

from sklearn.model_selection import train_test_split

## 2. Import Dataset

In [3]:
Project_Def=r"C:\Users\Debasish Das\Desktop\CHURN_PREDICTION"
Data_Dir="Dataset"

In [12]:
def get_data(name):
    file_name=f"{name}.csv"
    file_path=os.path.join(Project_Def,Data_Dir,file_name)
    return pd.read_csv(file_path)

In [14]:
churn=get_data("churn")
churn

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [16]:
churn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

- No missing Value 
- No Data type error

## 3. Preliminary Analysis

### 3.1. Data Types

In [22]:
churn.dtypes

RowNumber            int64
CustomerId           int64
Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object

### 3.2. Check Duplicates

In [20]:
churn.duplicated().sum()

np.int64(0)

### 3.3. Overvation

- No duplicates row
- No null values

## 4. Detailed Analysis

In [26]:
(
    
    churn.rename(columns=str.lower)
        
)

,rownumber,customerid,surname,creditscore,geography,gender,age,tenure,balance,numofproducts,hascrcard,isactivemember,estimatedsalary,exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

### 4.1. Customerid

In [27]:
churn.CustomerId

0       15634602
1       15647311
2       15619304
3       15701354
4       15737888
          ...
9995    15606229
9996    15569892
9997    15584532
9998    15682355
9999    15628319
Name: CustomerId, Length: 10000, dtype: int64

In [31]:
churn.CustomerId.unique().shape

(10000,)

- `CostomerID` are unique
- `Rownumber` & `CostomerID` are unnecessary columns

### 4.2. Surname

In [32]:
churn.Surname

0        Hargrave
1            Hill
2            Onio
3            Boni
4        Mitchell
          ...
9995     Obijiaku
9996    Johnstone
9997          Liu
9998    Sabbatini
9999       Walker
Name: Surname, Length: 10000, dtype: object

In [39]:
churn.Surname.unique()

array(['Hargrave', 'Hill', 'Onio', ..., 'Kashiwagi', 'Aldridge',
       'Burbidge'], dtype=object)

In [38]:
churn.Surname.unique().shape

(2932,)

In [48]:
churn.Surname.describe(include="o")

count     10000
unique     2932
top       Smith
freq         32
Name: Surname, dtype: object

- I can not see any typo in `Surname` columns

### 4.3 Credit score

In [41]:
churn.CreditScore.describe()

count    10000.000000
mean       650.528800
std         96.653299
min        350.000000
25%        584.000000
50%        652.000000
75%        718.000000
max        850.000000
Name: CreditScore, dtype: float64

- No Outliers in `CreditScore` columns

### 4.4 Exited

In [42]:
churn.Exited.value_counts()

Exited
0    7963
1    2037
Name: count, dtype: int64

- Imbalanced Data

### 4.5 Geography

In [43]:
churn.Geography.value_counts()

Geography
France     5014
Germany    2509
Spain      2477
Name: count, dtype: int64

- mostly people are from France

### 4.6. Gender

In [44]:
churn.Gender.value_counts()

Gender
Male      5457
Female    4543
Name: count, dtype: int64

### 4.7. Age

In [45]:
churn.Age

0       42
1       41
2       42
3       39
4       43
        ..
9995    39
9996    35
9997    36
9998    42
9999    28
Name: Age, Length: 10000, dtype: int64

In [47]:
churn.Age.describe()

count    10000.000000
mean        38.921800
std         10.487806
min         18.000000
25%         32.000000
50%         37.000000
75%         44.000000
max         92.000000
Name: Age, dtype: float64

- No Outliers in `Age` column

### 4.8. Balance

In [49]:
churn.Balance.describe()

count     10000.000000
mean      76485.889288
std       62397.405202
min           0.000000
25%           0.000000
50%       97198.540000
75%      127644.240000
max      250898.090000
Name: Balance, dtype: float64

### 4.9. IsActiveMember

In [50]:
churn.IsActiveMember.value_counts()

IsActiveMember
1    5151
0    4849
Name: count, dtype: int64

### 4.10 EstimatedSalary

In [52]:
churn.EstimatedSalary.describe()

count     10000.000000
mean     100090.239881
std       57510.492818
min          11.580000
25%       51002.110000
50%      100193.915000
75%      149388.247500
max      199992.480000
Name: EstimatedSalary, dtype: float64

### 4.11. HasCrCard

In [53]:
churn.HasCrCard.value_counts()

HasCrCard
1    7055
0    2945
Name: count, dtype: int64

- mostly people have Credit card

### 4.12. NumofProducts

In [54]:
churn.NumOfProducts.value_counts()

NumOfProducts
1    5084
2    4590
3     266
4      60
Name: count, dtype: int64

### 4.13. Tenure

In [55]:
churn.Tenure.value_counts()

Tenure
2     1048
1     1035
7     1028
8     1025
5     1012
3     1009
4      989
9      984
6      967
10     490
0      413
Name: count, dtype: int64

## 5. Data Cleaning

In [59]:
def clean_data(df):
    return (
        df
        .rename(columns=str.lower)
        .drop(columns=["rownumber","customerid"])
    )

In [60]:
df=clean_data(churn)
df

,surname,creditscore,geography,gender,age,tenure,balance,numofproducts,hascrcard,isactivemember,estimatedsalary,exited
0,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

## 6. Split And Export

In [61]:
x=df.drop(columns="exited")
y=df.exited.copy()

In [62]:
x_,x_test,y_,y_test=train_test_split(x,y,test_size=0.2,random_state=42)
x_train,x_val,y_train,y_val=train_test_split(x_,y_,test_size=0.2,random_state=42)

In [65]:
def export_data(x,y,name):
    file_name=f"{name}.csv"
    file_path=os.path.join(Project_Def,Data_Dir,file_name)
    x.join(y).to_csv(file_path, index=False)
    return pd.read_csv(file_path).info()

In [66]:
export_data(x_train,y_train,"train")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6400 entries, 0 to 6399
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   surname          6400 non-null   object
 1   creditscore      6400 non-null   int64
 2   geography        6400 non-null   object
 3   gender           6400 non-null   object
 4   age              6400 non-null   int64
 5   tenure           6400 non-null   int64
 6   balance          6400 non-null   float64
 7   numofproducts    6400 non-null   int64
 8   hascrcard        6400 non-null   int64
 9   isactivemember   6400 non-null   int64
 10  estimatedsalary  6400 non-null   float64
 11  exited           6400 non-null   int64
dtypes: float64(2), int64(7), object(3)
memory usage: 600.1+ KB

In [67]:
export_data(x_val,y_val,"val")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1600 entries, 0 to 1599
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   surname          1600 non-null   object
 1   creditscore      1600 non-null   int64
 2   geography        1600 non-null   object
 3   gender           1600 non-null   object
 4   age              1600 non-null   int64
 5   tenure           1600 non-null   int64
 6   balance          1600 non-null   float64
 7   numofproducts    1600 non-null   int64
 8   hascrcard        1600 non-null   int64
 9   isactivemember   1600 non-null   int64
 10  estimatedsalary  1600 non-null   float64
 11  exited           1600 non-null   int64
dtypes: float64(2), int64(7), object(3)
memory usage: 150.1+ KB

In [69]:
export_data(x_test,y_test,"test")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   surname          2000 non-null   object
 1   creditscore      2000 non-null   int64
 2   geography        2000 non-null   object
 3   gender           2000 non-null   object
 4   age              2000 non-null   int64
 5   tenure           2000 non-null   int64
 6   balance          2000 non-null   float64
 7   numofproducts    2000 non-null   int64
 8   hascrcard        2000 non-null   int64
 9   isactivemember   2000 non-null   int64
 10  estimatedsalary  2000 non-null   float64
 11  exited           2000 non-null   int64
dtypes: float64(2), int64(7), object(3)
memory usage: 187.6+ KB